import { v4 as uuidv4 } from 'uuid'

export const advantagesArray = [
  {
    id: uuidv4(),
    number: '100+',
    title: 'Реализованные проекты',
    text: 'Работаем с любой недвижимостью – от дворцов до квартир',
  },
  {
    id: uuidv4(),
    number: '10 лет',
    title: 'Безупречная репутация',
    text: 'Наши специалисты постоянно стажируются у лидеров строительных работ',
  },
  {
    id: uuidv4(),
    number: '3 года',
    title: 'Гарантии на все работы',
    text: 'Мы внимательно изучаем рынок отделочных материалов и инновационной техники',
  },
  {
    id: uuidv4(),
    number: 'Сроки',
    title: 'Процесс',
    text: ' Нужно лучшее – закажи это у лучших!',
  },
]