import { v4 as uuidv4 } from 'uuid'

import blog1 from '../pages/Blog/images/blog1.jpg'
import blog1_1 from '../pages/Blog/images/blog1.1.jpg'
import blog1_2 from '../pages/Blog/images/blog1.2.jpg'
import blog2 from '../pages/Blog/images/blog2.jpg'
import blog2_1 from '../pages/Blog/images/blog2.1.jpg'
import blog2_2 from '../pages/Blog/images/blog2.2.jpg'
import blog3 from '../pages/Blog/images/blog3.jpg'
import blog3_1 from '../pages/Blog/images/blog3.1.jpg'
import blog3_2 from '../pages/Blog/images/blog3.2.jpg'
import blog4 from '../pages/Blog/images/blog4.jpg'
import blog4_1 from '../pages/Blog/images/blog4.1.jpg'
import blog4_2 from '../pages/Blog/images/blog4.2.jpg'
import blog5 from '../pages/Blog/images/blog5.jpg'
import blog5_1 from '../pages/Blog/images/blog5.1.jpg'
import blog5_2 from '../pages/Blog/images/blog5.2.jpg'
import blog6 from '../pages/Blog/images/blog6.jpg'
import blog6_1 from '../pages/Blog/images/blog6.1.jpg'
import blog6_2 from '../pages/Blog/images/blog6.2.jpg'

export const blogData = [
  {
    blogId: uuidv4(),
    date: '2023, Апрель',
    title: 'Правила сервировки стола по этикету',
    text1: 'Торжественно сервированный стол — это внимательность к гостям, возможность проявить к ним уважение, создать атмосферу праздника. Прежде чем разобраться с тем, как правильно сервировать стол, необходимо понять главные цели этого мероприятия. На первый взгляд все кажется очень сложным, но уже через пару тренировок все будет даваться легко и быстро. Оно необходимо, чтобы создать комфорт для гостей во время застолья и сборов, сформировать хорошую и радостную атмосферу. Считается, что сервировка стола требуется исключительно по праздникам, но это общее заблуждение. Красиво оформить трапезу и создавать небольшой праздник можно в семье каждый день. Чтобы стол выглядел красиво, хватит чистой скатерти, нескольких столовых приборов, салфеток. Также можно использовать маленькое украшение, к примеру, подойдет ваза с фруктами, миниатюрный букетик цветок.',
    text2: 'Последовательность сервировки стола: расстелить на стол плотную белую скатерть из любой ткани. Она используется для защиты поверхности стола, а также будет заглушать звуки. Расстелить праздничную скатерть прямо на плотную материю. При выборе скатерти лучше всего учитывать влияние оттенков на людей. К примеру, красный усиливает аппетит, синий, наоборот, его приглушает. Расцветка должна быть подобрана так, чтобы соответствовала случаю. Выложить украшения на поверхности стола так, чтобы они были видны всем гостям. Не нужно выбирать слишком яркие изделия. Емкость с напитками нужно расположить таким образом, чтобы все имели к ним доступ.Выставить столовые приборы и тарелки в том количестве, сколько запланировано гостей. Неправильным считается оставлять тарелки для людей, которые так и не пришли. Оформить салфетки и разложить их в нужных местах. Использовать бонбоньерки по желанию. Это небольшие сюрпризы для гостей, например, конфеты. Обычно их помещают в небольшую коробочку или мешочек и расставляют возле тарелок. Расставить бокалы. Напротив каждой тарелки расставить стулья, чтобы гости удобно сидели. Это основные правила этикета, которые нужно всегда неукоснительно соблюдать для сервировки стола.',
    link: 'https://www.kuchenland.ru/blog/kak-pravilno-servirovat-stol/',
    imgMain: blog5,
    img1: blog5_1,
    img2: blog5_2,
    author: 'Kuchenland',
  },
  {
    blogId: uuidv4(),
    date: '2023, Март',
    title: 'Лучшие сочетания цветов для любого интерьера.',
    text1: 'Впечатление, которое производит интерьер, можно определить, едва переступив порог. Будет ли он уютным, строгим, жизнерадостным или спокойным – во многом зависит от цветовой гаммы. Чтобы задать нужное настроение в комнате и избежать ошибок в сочетании оттенков, обратимся к подсказкам. Определиться с цветовой гаммой помещения во время ремонта – непростая задача. Помимо личных предпочтений, важно учитывать правила сочетания оттенков, чтобы интерьер получился комфортным и располагающим. Для этого стоит разобраться в базовых принципах колористики. Каждый цвет имеет свою температуру. Самым тёплым считается красно-оранжевый, а самым холодным – сине-зелёный. В зависимости от того, ближе к какому «полюсу» находится тот или иной оттенок, он будет теплее или холоднее. Холодные тона – голубой, мятный, фиолетовый, изумрудно-зелёный. Интерьер, построенный на сочетании холодных цветов, кажется светлым, чистым, свежим. Даже температура в нём ощущается ниже. Оттенки красного, жёлтого, оранжевого, травянисто-зелёного, согревают и дарят уют. В чистом виде они несут много энергии, а в разбавленном – успокаивают и обволакивают.',
    text2: 'Кстати! Чёрный, белый и серый считаются нейтральными цветами и легко комбинируются со всеми остальными. Самая простая комбинация – два противолежащих цвета: красный и зелёный, жёлтый и фиолетовый, синий и оранжевый. Их ещё называют комплементарными или контрастными. Чистые контрастные цвета обладают большой яркостью и сильным визуальным эффектом. Чтобы не устать от интерьера, обратите внимание на их приглушённые оттенки. Например, вместо ярко-зелёного используйте оливковый цвет в интерьере. Чёрный цвет в жилых пространствах чаще выполняет роль акцента, а вот серый служит отличной нейтральной основой. Красочные пятна станут изюминкой серого монохрома. елые стены – идеальное полотно для любого дизайна, от классики до хай-тека. На их фоне эффектно играют все сочетания ярких и пастельных цветов. Центром композиции делают не только мебель, но и картины. Бежевый цвет в интерьере некоторые относят к нейтральным, и он действительно сочетается с большинством цветов. Важно следить за оттенком и выбирать наиболее удачные тандемы.',
    link: 'https://dg-home.ru/blog/luchshie-sochetaniya-tsvetov-dlya-lyubogo-interera_b911659/',
    imgMain: blog4,
    img1: blog4_1,
    img2: blog4_2,
    author: 'Екатерина Асатурова',
  },
  {
    blogId: uuidv4(),
    date: '2023, Январь',
    title: 'Декор на кухне: чем украсить стены?',
    text1: 'Придумываем интересные варианты настенного декора для кухни. На кухне члены семьи ежедневно проводят много времени. Поэтому важно сделать комнату уютной и комфортной. Рассказываем способы декора стен на кухне и делимся нетривиальными дизайнерскими решениями. Выберите подходящее место для настенного декора. На кухне это участки над столом, гарнитуром, мойкой. Также подойдут свободные простенки между окнами, ниши, пространство над дверью. Заранее составьте композицию и попробуйте разложить элементы на полу. Можно разместить детали как симметрично, так и хаотично. Главное, чтобы декоративный ансамбль выглядел оригинально и органично. Не размещайте много украшений на маленькой кухне. Иначе помещение будет визуально казаться еще компактнее. А вот в просторной комнате можно смело экспериментировать с разными видами декор',
    text2: 'Если в обстановке кухни много предметов, старайтесь разместить на стенах поменьше украшений. В противном случае возникнет стилистический диссонанс. Выбирайте декор, исходя из стиля интерьера и цветовой гаммы. Предметы могут быть и контрастными. Однако следите, чтобы они гармонировали с обстановкой. Декор темных стен будет одним, светлых — совершенно другим. Если уже имеющийся декор кажется невыразительным, можно дополнить его другими украшениями в аналогичном стиле. Например, рядом с картиной разместить еще несколько полотен. Получится мини-галерея, которая обязательно привлечет восхищенные взгляды. Если хотите оригинально оформить кухню-столовую, сделайте зонирование с помощью аксессуаров. Для рабочего участка выбирайте минималистичные украшения, для обеденного — антуражные, оригинальные.',
    link: 'https://dg-home.ru/blog/chem-ukrasit-steny_b912150/',
    imgMain: blog3,
    img1: blog3_1,
    img2: blog3_2,
    author: 'Ирэн Гайдукова',
  },
  {
    blogId: uuidv4(),
    date: '2021, Июнь',
    title: 'Изучаем разновидности штор для окон и декоративных занавесок.',
    text1: 'Без занавесок на окнах интерьер выглядит незавершенным. Однако неправильный выбор штор сведет на нет все усилия по оформлению комнат. Разберемся, какие есть варианты, и для чего предназначена каждая разновидность оконного декора. При желании можно вписать в обстановку любую модель штор. Однако в случае ошибки впечатление о дизайне комнаты будет испорчено. ',
    text2: 'Рассказываем, как сделать верный выбор. Оцените, куда выходят окна. Если на север, отдайте предпочтение легким полупрозрачным занавескам. В комнате и так мало естественного света, а плотные портьеры вообще закроют путь солнечным лучам.Выбирайте изделия, исходя из стиля интерьера. В классические направления вписываются одни модели, в современные — совершенно другие. Учитывайте предназначение помещения. Например, для кухни подойдут практичные варианты из плотных тканей или рулонные шторы. Для гостиной элегантные портьеры или оригинальные легкие занавески. Тщательно выбирайте цветовую гамму. Ориентируйтесь на основные цвета в обстановке. Можно предпочесть шторы аналогичных тонов или сыграть на контрасте. Будьте осторожнее с декором. Роскошные подхваты и ламбрекены не всегда уместны в обстановке.Измерьте ширину оконного проема. На узких окнах будут нелепо смотреться тяжелые портьеры. Не забывайте о личных предпочтениях. Если вам нравятся определенные виды штор, смело ищите пути их интеграции в интерьер. Не забудьте изучить, как правильно повесить занавески.',
    link: 'https://dg-home.ru/blog/vidy-shtor_b561354/',
    imgMain: blog2,
    img1: blog2_1,
    img2: blog2_2,
    author: 'Ирэн Гайдукова',
  },
  {
    blogId: uuidv4(),
    date: '2021, Декабрь',
    title: 'Гардеробный шкаф в прихожей.',
    text1: 'Пространство при входе в дом - одно из наиболее функциональных помещений. Здесь хранится множество мелочей, верхней одежды, обуви, аксессуаров. Организация зоны должна быть выстроена таким образом, чтоб скрыть от глаз обилие вещей, но при этом соблюсти максимальный порядок и функционал. Гардероб в прихожей в таком случае просто незаменим. В зависимости от стиля интерьера дома и размеров помещения возможна установка гардеробной в прихожей, как с раздвижными дверями, так и с распашными. Учитывайте тот момент, что полотно-купе устанавливается на направляющие рельсы, которые крепятся к полу и потолку. Соответственно при передвижении двери вы открываете обзору всю высоту полок и их содержимого. При распашном варианте возможно предусмотреть разграничение общего пространства гардеробной на небольшие зоны за каждой дверцей.',
    text2: 'Как оформить гардеробную? Внешний облик гардеробной системы зависит не только от её размеров, но и от индивидуальных предпочтений и стилистики дома в целом. Не стоит пространство в стиле хай-тек загромождать шкафом из натурального дерева да еще и с распашными дверями. Стекло и глянцевые лаконичные поверхности здесь будут гораздо уместнее. Английский стиль дома может дополнить гардероб с изысканной объемной фурнитурой и нарядными фасадами. Вариации открытых систем органично будут смотреться в городском лофте или скандинавском интерьере. Шкаф-гардеробная, пожалуй, один из предметов мебели, без которого не обходится ни один дом. Подходите к организации этого вида пространства, прежде всего, с точки зрения функциональности и практичности и тогда ежедневные процедуры по выбору одежды будут комфортными и создадут легкое настроение всему дню.',
    link: 'https://dg-home.ru/blog/shkaf-garderobnaya-v-prikhozhuyu_b641041/',
    imgMain: blog6,
    img1: blog6_1,
    img2: blog6_2,
    author: 'Ирина Гилета',
  },
  {
    blogId: uuidv4(),
    date: '2020, Июнь',
    title: 'Как определить компетенцию дизайнера ничего не зная о дизайне интерьера?',
    text1: 'Сегодня вопрос профессиональной подготовки дизайнеров интерьера весьма актуален. Существует множество онлайн-курсов, которые обещают за два месяца обучить новой творческой профессии любого желающего. При этом преподаватели таких курсов успевают лишь кратко затронуть начальные теоретические аспекты, не имея возможности предоставить хоть какую-либо практическую базу.После обучения выпускники начинают работать с реальными заказчиками и творческая профессия превращается в ночной кошмар как для студентов, прошедших двухмесячный курс, так и для хозяев квартиры, столкнувшихся с катастрофой: решения, заложенные в дизайн-проект либо не реализуемы технически, либо ошибки проекта проявились уже на строительном этапе и привели к переделыванию ремонта, выходу за рамки бюджета и нарушению сроков. Возникает актуальный вопрос: как среди огромного количества специалистов определить компетенцию дизайнера, ничего не зная о дизайне интерьера?',
    text2: 'Хороший специалист строит свою работу таким образом, чтобы всегда оставаться эффективным и максимально продуктивным. Дизайн интерьера в целом — процесс контролируемый и далеко не всегда творческий. Если перед вами дизайнер с хорошим вкусом, плотно сотрудничает со строителями, помнит и признаёт свои ошибки, работает с законодательными требованиями и с вниманием относится к обозначенному бюджету то, с вероятностью 95%, у вас не будет проблем с проектом. Дальнейший успех реализации интерьера будет зависеть от строительных исполнителей, но, это уже совсем другая история.',
    imgMain: blog1,
    img1: blog1_1,
    img2: blog1_2,
    author: 'Лина Зацеляпина',
    link: 'https://medium.com/@info_28500/%D0%BA%D0%B0%D0%BA-%D0%BE%D0%BF%D1%80%D0%B5%D0%B4%D0%B5%D0%BB%D0%B8%D1%82%D1%8C-%D0%BA%D0%BE%D0%BC%D0%BF%D0%B5%D1%82%D0%B5%D0%BD%D1%86%D0%B8%D1%8E-%D0%B4%D0%B8%D0%B7%D0%B0%D0%B9%D0%BD%D0%B5%D1%80%D0%B0-%D0%BD%D0%B8%D1%87%D0%B5%D0%B3%D0%BE-%D0%BD%D0%B5-%D0%B7%D0%BD%D0%B0%D1%8F-%D0%BE-%D0%B4%D0%B8%D0%B7%D0%B0%D0%B9%D0%BD%D0%B5-%D0%B8%D0%BD%D1%82%D0%B5%D1%80%D1%8C%D0%B5%D1%80%D0%B0-%D0%BC%D0%B5%D1%82%D0%BE%D0%B4-%D0%B8%D0%B7-9-%D0%B2%D0%BE%D0%BF%D1%80%D0%BE%D1%81%D0%BE%D0%B2-48ad9cc913',
  },
]