export const processData = [
  {
    number: '01',
    title: 'Выбор стиля проекта',
    customer: 'Заказчик',
    textCustomer: 'Хочется видеть смешение цветов - зелёного, серого и черного в дизайне. Уж больно нравятся такие цвета))',
    executor: null,
    textExecutor: null,
  },
  {
    number: '02',
    title: 'Чертежи и согласование с закачиком идей по проекту',
    customer: 'Заказчик',
    textCustomer: 'Да, утверждаем выбранные идеи по стилю проекта!',
    executor: 'Арт-директор',
    textExecutor: 'Отлично! Тогда согласовываем сроки и договор по проекту! И наши сотрудники выпонят работу в наилучшем качестве.',
  },
  {
    number: '03',
    title: '3D визуализация проекта',
    customer: 'Заказчик',
    textCustomer: 'Отличные визы. Очень нравятся! Надеюсь, так же будет и “в живую”))',
    executor: 'Арт-директор',
    textExecutor: 'Наши дизайнеры и мастера настоящие профессионалы. Уверены, Вы останетесь довольны результатом!',
  },
  {
    number: '04',
    title: 'Ремонт',
    customer: 'Заказчик',
    textCustomer: 'Отличные визы. Очень нравятся! Надеюсь, так же будет и “в живую”))',
    executor: 'Арт-директор',
    textExecutor: 'Наши дизайнеры и мастера настоящие профессионалы. Уверены, Вы останетесь довольны результатом!',
  },
  {
    number: '05',
    title: 'Сдача готового объекта',
    customer: 'Заказчик',
    textCustomer: 'Спасибо вам за превосходную работу! Очень довольны результатом))',
    executor: 'Арт-директор',
    textExecutor: 'Мы делаем лучшее для лучших! Спасибо вам, что обратились в нашу компанию))!',
  },
]

export const processMessageData = [
  {
    id: crypto.randomUUID(),
    customer: 'Заказчик',
    textCustomer: 'Хочется видеть смешение цветов - зелёного, серого и черного в дизайне. Уж больно нравятся такие цвета))',
    executor: '',
    textExecutor: '',
  },
  {
    id: crypto.randomUUID(),
    customer: 'Заказчик',
    textCustomer: 'Да, утверждаем выбранные идеи по стилю проекта!',
    executor: 'Арт-директор',
    textExecutor: 'Отлично! Тогда согласовываем сроки и договор по проекту! И наши сотрудники выпонят работу в наилучшем качестве.',
  },
  {
    id: crypto.randomUUID(),
    customer: 'Заказчик',
    textCustomer: 'Отличные визы. Очень нравятся! Надеюсь, так же будет и “в живую”))',
    executor: 'Арт-директор',
    textExecutor: 'Наши дизайнеры и мастера настоящие профессионалы. Уверены, Вы останетесь довольны результатом!',
  },
  {
    id: crypto.randomUUID(),
    customer: 'Заказчик',
    textCustomer: 'Спасибо вам за превосходную работу! Очень довольны результатом))',
    executor: 'Арт-директор',
    textExecutor: 'Мы делаем лучшее для лучших! Спасибо вам, что обратились в нашу компанию))!',
  },
]